{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 64, 128, 3], "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-5-836267c8fc21>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_2", "function_type": "lambda", "trainable": true, "output_shape": [64, 128, 3], "output_shape_type": "raw", "arguments": {}}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_filter": 16, "subsample": [1, 1], "activation": "linear", "trainable": true, "border_mode": "valid", "bias": true, "b_regularizer": null, "dim_ordering": "tf", "nb_row": 8, "name": "convolution2d_5", "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "nb_col": 8}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [1, 2], "strides": [1, 2], "name": "maxpooling2d_2", "trainable": true, "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_7"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_filter": 32, "subsample": [1, 1], "activation": "linear", "trainable": true, "border_mode": "valid", "bias": true, "b_regularizer": null, "dim_ordering": "tf", "nb_row": 5, "name": "convolution2d_6", "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "nb_col": 5}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_3", "trainable": true, "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_8"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_filter": 48, "subsample": [1, 1], "activation": "linear", "trainable": true, "border_mode": "valid", "bias": true, "b_regularizer": null, "dim_ordering": "tf", "nb_row": 5, "name": "convolution2d_7", "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "nb_col": 5}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_4", "trainable": true, "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_9"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_filter": 64, "subsample": [1, 1], "activation": "linear", "trainable": true, "border_mode": "valid", "bias": true, "b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "name": "convolution2d_8", "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "nb_col": 3}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_5", "trainable": true, "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_10"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_filter": 64, "subsample": [1, 1], "activation": "linear", "trainable": true, "border_mode": "valid", "bias": true, "b_regularizer": null, "dim_ordering": "tf", "nb_row": 1, "name": "convolution2d_9", "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "nb_col": 1}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [1, 2], "strides": [1, 2], "name": "maxpooling2d_6", "trainable": true, "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_11"}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activation": "linear", "trainable": true, "W_constraint": null, "b_regularizer": null, "name": "dense_3", "input_dim": 512, "activity_regularizer": null, "output_dim": 128, "b_constraint": null, "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_12"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activation": "linear", "trainable": true, "W_constraint": null, "b_regularizer": null, "name": "dense_4", "input_dim": 128, "activity_regularizer": null, "output_dim": 64, "b_constraint": null, "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_13"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activation": "linear", "trainable": true, "W_constraint": null, "b_regularizer": null, "name": "dense_5", "input_dim": 64, "activity_regularizer": null, "output_dim": 32, "b_constraint": null, "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_14"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activation": "linear", "trainable": true, "W_constraint": null, "b_regularizer": null, "name": "dense_6", "input_dim": 32, "activity_regularizer": null, "output_dim": 1, "b_constraint": null, "W_regularizer": null, "bias": true}}]}